test/assets/vcr_cassettes/reservation_authorize.yml

---
http_interactions:
- request:
    method: post
    uri: https://sk_test_r0wxkPFASg9e45UIakAhgpru:@api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=5500&currency=usd&card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=2020&card[cvc]=411&payment_user_agent=Stripe%2Fv1+ActiveMerchantBindings%2F1.43.1&capture=false
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.43.1
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.43.1","lang":"ruby","lang_version":"1.9.3 p484 (2013-11-22)","platform":"x86_64-darwin13.1.0","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - ! '{"ip":null}'
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 19 May 2014 00:36:05 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '977'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"ch_1043mJ4jC1s34dJW71FunGXl\",\n  \"object\": \"charge\",\n
        \ \"created\": 1400459765,\n  \"livemode\": false,\n  \"paid\": true,\n  \"amount\":
        5500,\n  \"currency\": \"usd\",\n  \"refunded\": false,\n  \"card\": {\n    \"id\":
        \"card_1043mJ4jC1s34dJWISf3WTfo\",\n    \"object\": \"card\",\n    \"last4\":
        \"4242\",\n    \"type\": \"Visa\",\n    \"exp_month\": 12,\n    \"exp_year\":
        2020,\n    \"fingerprint\": \"mFydmlYyN8amTBcD\",\n    \"customer\": null,\n
        \   \"country\": \"US\",\n    \"name\": null,\n    \"address_line1\": null,\n
        \   \"address_line2\": null,\n    \"address_city\": null,\n    \"address_state\":
        null,\n    \"address_zip\": null,\n    \"address_country\": null,\n    \"cvc_check\":
        \"pass\",\n    \"address_line1_check\": null,\n    \"address_zip_check\":
        null\n  },\n  \"captured\": false,\n  \"refunds\": [],\n  \"balance_transaction\":
        null,\n  \"failure_message\": null,\n  \"failure_code\": null,\n  \"amount_refunded\":
        0,\n  \"customer\": null,\n  \"invoice\": null,\n  \"description\": null,\n
        \ \"dispute\": null,\n  \"metadata\": {},\n  \"statement_description\": null\n}\n"
    http_version: 
  recorded_at: Mon, 19 May 2014 00:36:05 GMT
recorded_with: VCR 2.4.0
